# Data Frames and Data Series in Pandas

In [3]:
import pandas as pd
import numpy as np

In [4]:
df=pd.DataFrame(np.arange(1,21).reshape(5,4),index=['R_one','R_two','R_three','R_four','R_five'],columns=['Col1','Col2','Col3','Col4'])

In [5]:
df.head()

         Col1  Col2  Col3  Col4
R_one       1     2     3     4
R_two       5     6     7     8
R_three     9    10    11    12
R_four     13    14    15    16
R_five     17    18    19    20

In [6]:
# Turning the data into a csv file

df.to_csv('Data_Frame01')

# How to access elements, in the rows and indexes

In [8]:
# Accesing elements

# 1. .loc 2.    .iloc
df.loc['R_one']

Col1    1
Col2    2
Col3    3
Col4    4
Name: R_one, dtype: int64

In [10]:
# Data Series
type(df.loc['R_one'])

pandas.core.series.Series

## iloc function

In [11]:
df.iloc[0:2, 0:2]

       Col1  Col2
R_one     1     2
R_two     5     6

In [14]:
type(df.iloc[3:,1: ])

pandas.core.frame.DataFrame

In [15]:
df

         Col1  Col2  Col3  Col4
R_one       1     2     3     4
R_two       5     6     7     8
R_three     9    10    11    12
R_four     13    14    15    16
R_five     17    18    19    20

In [16]:
# Into an array
df.iloc[:,1:].values

array([[ 2,  3,  4],
       [ 6,  7,  8],
       [10, 11, 12],
       [14, 15, 16],
       [18, 19, 20]])

In [17]:
df['Col2'].value_counts()

Col2
2     1
6     1
10    1
14    1
18    1
Name: count, dtype: int64

In [18]:
df['Col2'].unique()

array([ 2,  6, 10, 14, 18])

In [22]:
df[['Col3', 'Col4']]

         Col3  Col4
R_one       3     4
R_two       7     8
R_three    11    12
R_four     15    16
R_five     19    20